## Pandas DataFrame 3

In [1]:
import pandas as pd

In [2]:
data = {'name': ['Janet', 'Nad', 'Timothy', 'June', 'Amy'],
        'year': [2012, 2012, 2013, 2014, 2014],
        'reports': [6, 13, 14, 1 ,7] }

In [9]:
df = pd.DataFrame(data, index = ['Singapore', 'China', 'Japan', 'Sweden', 'Norway'])

In [10]:
df

              name  reports  year
Singapore    Janet        6  2012
China          Nad       13  2012
Japan      Timothy       14  2013
Sweden        June        1  2014
Norway         Amy        7  2014

### Agregamos una columna

In [11]:
import numpy as np

In [12]:
schools = np.array(["Cambridge", "Oxford", "Oxford", "Cambridge", "Oxford"])
df["schools"] = schools

In [13]:
df.head()

              name  reports  year    schools
Singapore    Janet        6  2012  Cambridge
China          Nad       13  2012     Oxford
Japan      Timothy       14  2013     Oxford
Sweden        June        1  2014  Cambridge
Norway         Amy        7  2014     Oxford

### Removiendo filas

In [16]:
df.drop(['China', 'Japan'])

            name  reports  year    schools
Singapore  Janet        6  2012  Cambridge
Sweden      June        1  2014  Cambridge
Norway       Amy        7  2014     Oxford

In [17]:
df # no cambia el dataframe original

              name  reports  year    schools
Singapore    Janet        6  2012  Cambridge
China          Nad       13  2012     Oxford
Japan      Timothy       14  2013     Oxford
Sweden        June        1  2014  Cambridge
Norway         Amy        7  2014     Oxford

Si queremos quitar una fila basada en una columna en particular hacemos lo siguiente:

In [20]:
df[df.name != 'Nad']

              name  reports  year    schools
Singapore    Janet        6  2012  Cambridge
Japan      Timothy       14  2013     Oxford
Sweden        June        1  2014  Cambridge
Norway         Amy        7  2014     Oxford

Tambien podemos retirar todo una fila

In [23]:
df.drop(df.index[1])

              name  reports  year    schools
Singapore    Janet        6  2012  Cambridge
Japan      Timothy       14  2013     Oxford
Sweden        June        1  2014  Cambridge
Norway         Amy        7  2014     Oxford

Hasta más columnas a la vez

In [24]:
df.drop(df.index[[1,3]])

              name  reports  year    schools
Singapore    Janet        6  2012  Cambridge
Japan      Timothy       14  2013     Oxford
Norway         Amy        7  2014     Oxford

Si queremos retirar la segunda columna comenzando desde el final

In [27]:
df.drop(df.index[-2])

              name  reports  year    schools
Singapore    Janet        6  2012  Cambridge
China          Nad       13  2012     Oxford
Japan      Timothy       14  2013     Oxford
Norway         Amy        7  2014     Oxford

### Removiendo columnas

In [30]:
df.drop('reports',axis = 1)

              name  year    schools
Singapore    Janet  2012  Cambridge
China          Nad  2012     Oxford
Japan      Timothy  2013     Oxford
Sweden        June  2014  Cambridge
Norway         Amy  2014     Oxford

In [31]:
df.drop(df.columns[1], axis=1)

              name  year    schools
Singapore    Janet  2012  Cambridge
China          Nad  2012     Oxford
Japan      Timothy  2013     Oxford
Sweden        June  2014  Cambridge
Norway         Amy  2014     Oxford

Removiendo varias columnas

In [33]:
df.drop(df.columns[[0,3]], axis = 1)

           reports  year
Singapore        6  2012
China           13  2012
Japan           14  2013
Sweden           1  2014
Norway           7  2014

### Generando un Crosstab (dataframe intersectados)

En estadistica se usa los crosstab para mostrar la relación de dos variables y mostrarlas conjuntamente

In [35]:
df = pd.DataFrame(
    {
        "Gender": ['Male','Male','Female','Female','Female'],
        "Team": [1,2,3,3,1]
    })

Aqui creamos un dataframe en el cual vemos que existen 5 personas cada uno tiene un género y es parte de un equipo (team).

In [36]:
df

   Gender  Team
0    Male     1
1    Male     2
2  Female     3
3  Female     3
4  Female     1

Usando crosstab podemos resumir esta tabla y cruzar la información para tener género vs equipo.

In [37]:
print('Mostrando la distribución de género en cada equipo')
pd.crosstab(df.Gender, df.Team)

Mostrando la distribución de género en cada equipo

Team    1  2  3
Gender
Female  1  0  2
Male    1  1  0

Si tu quieres ver la distribución en cada equipo por género basta con cambiar la posición de los parámetros

In [38]:
print('Mostrando la distribución de equipo por el género')
pd.crosstab(df.Team, df.Gender)

Mostrando la distribución de equipo por el género

Gender  Female  Male
Team
1            1     1
2            0     1
3            2     0

### Resumen

* Operaciones en los dataframe

![](dataframeoperations.png)